<div style="font-family: Arial; font-size: 14px; border-radius: 5px; background-color: #124384ff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: left;">NIM: 240907501033</div>
<div style="font-family: Arial; font-size: 14px; border-radius: 5px; background-color: #194c8eff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: left;">Nama: Kania Salsabila Haflin</div>

# <center><div style="font-family: Times New Roman; font-size: 20px; border-radius : 10px; background-color: #1c9ca3ff; color: #fff4f4ff; padding: 12px; line-height: 0.7;">PANDAS & DS + VISUAL</div></center>

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">1. Series</div></center>

In [67]:
import pandas as pd 
import numpy as np 

#P1 
#Menampilkan array 1-dimensi
ijo = pd.Series([13, 15, 17, 19, 21])
print(ijo)

#P2
sayap = pd.Series(['ayam', 'burung', 'kelelawar'])
kaki = np.array(['kucing', 'sapi', 'semut'])
sayap_kaki = pd.Series(kaki)

print(sayap)
print(sayap_kaki)

#Mengatur indeks pada numpy array_np di atas
sayap_kaki = pd.Series(kaki, index=['ikan =', 'rumput =', 'gula ='])
print(sayap_kaki)

#P3 contoh operasi
ds1 = pd.Series([28, 23, 11, 90, 67])
ds2 = pd.Series([35, 67, 22, 17, 49])
dsa = ds1 + ds2  
dsb = ds1 - ds2
dsc = ds1 * ds2
dsd = ds1 / ds2

print(dsa)
print(dsb)
print(dsc)
print(dsd)

#P4 konver pandas module Series ke python list
import pandas as pd

ds = pd.Series([8, 7, 6, 5, 4])
print("Pandas Series dan type")
print(ds)
print(type(ds))
print("Konver Pandas Series ke Python list")
print(ds.tolist())
print(type(ds.tolist()))

#P6
import pandas as pd
import numpy as np

#Generate angka random
num_state = np.random.RandomState(70)  
num_series = pd.Series(num_state.normal(5, 2, 8))
print(num_series)

0    13
1    15
2    17
3    19
4    21
dtype: int64
0         ayam
1       burung
2    kelelawar
dtype: object
0    kucing
1      sapi
2     semut
dtype: object
ikan =      kucing
rumput =      sapi
gula =       semut
dtype: object
0     63
1     90
2     33
3    107
4    116
dtype: int64
0    -7
1   -44
2   -11
3    73
4    18
dtype: int64
0     980
1    1541
2     242
3    1530
4    3283
dtype: int64
0    0.800000
1    0.343284
2    0.500000
3    5.294118
4    1.367347
dtype: float64
Pandas Series dan type
0    8
1    7
2    6
3    5
4    4
dtype: int64
<class 'pandas.core.series.Series'>
Konver Pandas Series ke Python list
[8, 7, 6, 5, 4]
<class 'list'>
0    6.701995
1    5.355510
2    3.293921
3    4.112201
4    4.594124
5    7.201031
6   -1.070272
7    4.170877
dtype: float64

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">2. Data Frame</div></center>

In [68]:
import pandas as pd

data = {
    'Nama': ['Saos', 'Sambal', 'Kecap'],
    'Harga': [15.000, 7.000, 10.000]
}

#DataFrame dengan parameter tambahan
df = pd.DataFrame(
    data,
    index=['1', '2', '3'],             
    columns=['Nama', 'Harga'],                                    
    copy=True                            
)

print(df)

     Nama  Harga
1    Saos   15.0
2  Sambal    7.0
3   Kecap   10.0

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">3. Load Data</div></center>

In [69]:
#P7.1 load data dari folder yang sama dengan coding
df = pd.read_csv('data_penjualan.csv') 
df.head(4) 
df.tail()

  Faktur Tanggal Penjualan Jenis Kelamin Jenis Barang  Jumlah  Harga Satuan
1   F002        2023-01-17        Wanita      Pakaian       1        200000
2   F003        2023-01-20          Pria   Elektronik       1        500000
3   F004        2023-01-22        Wanita     Kosmetik       3        100000
4   F005        2023-01-25          Pria      Pakaian       2        200000
5   F006        2023-01-28        Wanita   Elektronik       1        500000

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">4. Ekstrak & Manipulasi Data Frame</div></center>

In [70]:
#P8 menampilkan tabel jenis barang penjulan
import pandas as pd
df = pd.read_csv('data_penjualan.csv')
feb = df["Jenis Barang"]
feb.head()

0    Elektronik
1       Pakaian
2    Elektronik
3      Kosmetik
4       Pakaian
Name: Jenis Barang, dtype: object

In [71]:
#P9 
df= pd.read_csv('data_penjualan.csv')
df[['Harga Satuan','Jumlah']].head(5)

   Harga Satuan  Jumlah
0        500000       2
1        200000       1
2        500000       1
3        100000       3
4        200000       2

In [72]:
#P10.1
penjual = ['penjual no ' + str(i) for i in range(1, 11)]
penjual

['penjual no 1',
 'penjual no 2',
 'penjual no 3',
 'penjual no 4',
 'penjual no 5',
 'penjual no 6',
 'penjual no 7',
 'penjual no 8',
 'penjual no 9',
 'penjual no 10']

In [73]:
#P10.2
import pandas as pd

df = pd.read_csv('data_penjualan.csv')  
penjual = ['penjual no ' + str(i) for i in range(1, len(df) + 1)]
df['urutan'] = penjual
print(df.head())

  Faktur Tanggal Penjualan Jenis Kelamin Jenis Barang  Jumlah  Harga Satuan  \
0   F001        2023-01-15          Pria   Elektronik       2        500000
1   F002        2023-01-17        Wanita      Pakaian       1        200000
2   F003        2023-01-20          Pria   Elektronik       1        500000
3   F004        2023-01-22        Wanita     Kosmetik       3        100000
4   F005        2023-01-25          Pria      Pakaian       2        200000

         urutan
0  penjual no 1
1  penjual no 2
2  penjual no 3
3  penjual no 4
4  penjual no 5

In [74]:
# P.11 Ekstraksi Angka dari Teks
df['no'] = df['urutan'].str.extract('(\d+)').astype('int64')
df

,Faktur,Tanggal Penjualan,Jenis Kelamin,Jenis Barang,Jumlah,Harga Satuan,urutan,no
0,F001,2023-01-15,Pria,Elektronik,2,500000,penjual no 1,1
1,F002,2023-01-17,Wanita,Pakaian,1,200000,penjual no 2,2
2,F003,2023-01-20,Pria,Elektronik,1,500000,penjual no 3,3
3,F004,2023-01-22,Wanita,Kosmetik,3,100000,penjual no 4,4
4,F005,2023-01-25,Pria,Pakaian,2,200000,penjual no 5,5
5,F006,2023-01-28,Wanita,Elektronik,1,500000,penjual no 6,6

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">5. Memilih Data Data Berdsarkan Baris & Kolom</div></center>

In [75]:
#P12.1 menampilkan baris dengan indeks berlabel 0
df.loc[0]
df.iloc[0]
df[:1]

,Faktur,Tanggal Penjualan,Jenis Kelamin,Jenis Barang,Jumlah,Harga Satuan,urutan,no
0,F001,2023-01-15,Pria,Elektronik,2,500000,penjual no 1,1

In [76]:
#P12.2 menampilkan baris indeks berlabel 0 dan kolom berlabel jan
df.loc[0, 'Jenis Barang']
df.iloc[0, 1]
df[['Jenis Barang']][:1]

  Jenis Barang
0   Elektronik

In [77]:
#P12.3 menampilkan baris 0-3, kolom 0(Faktur), 3(Jenis Barang), 4(Jumlah)
df.iloc[0:3, [0, 3, 4]]

  Faktur Jenis Barang  Jumlah
0   F001   Elektronik       2
1   F002      Pakaian       1
2   F003   Elektronik       1

In [78]:
#P12.4 Menampilkan semua baris pada kolom **Jumlah** dan **Harga Satuan**
df.loc[:, ['Jumlah', 'Harga Satuan']]
df.iloc[:, [0, 4]]
df[['Jumlah', 'Harga Satuan']]

   Jumlah  Harga Satuan
0       2        500000
1       1        200000
2       1        500000
3       3        100000
4       2        200000
5       1        500000

In [79]:
#P12.5 Menampilkan semua baris pada kolom Faktur sampai Jenis Kelamin
df.loc[:, 'Faktur':'Jenis Kelamin']
df.iloc[:, :3]
df[['Faktur', 'Tanggal Penjualan', 'Jenis Kelamin']]

  Faktur Tanggal Penjualan Jenis Kelamin
0   F001        2023-01-15          Pria
1   F002        2023-01-17        Wanita
2   F003        2023-01-20          Pria
3   F004        2023-01-22        Wanita
4   F005        2023-01-25          Pria
5   F006        2023-01-28        Wanita

In [80]:
#Menampilkan semua baris dan semua kolom
df.loc[:, :]
df.loc[:,]
df.iloc[:, :]

,Faktur,Tanggal Penjualan,Jenis Kelamin,Jenis Barang,Jumlah,Harga Satuan,urutan,no
0,F001,2023-01-15,Pria,Elektronik,2,500000,penjual no 1,1
1,F002,2023-01-17,Wanita,Pakaian,1,200000,penjual no 2,2
2,F003,2023-01-20,Pria,Elektronik,1,500000,penjual no 3,3
3,F004,2023-01-22,Wanita,Kosmetik,3,100000,penjual no 4,4
4,F005,2023-01-25,Pria,Pakaian,2,200000,penjual no 5,5
5,F006,2023-01-28,Wanita,Elektronik,1,500000,penjual no 6,6

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">6. Memfilter Data</div></center>

In [81]:
#P13.2 memilih milih Teks
df[df['Jenis Kelamin'].str.contains('Pria')]
df[df['Jenis Kelamin'].str.contains('Wanita')]

#Abaikan Huruf Besar/Kecil
df[df['Jenis Kelamin'].str.contains('in')]

import re

df[df['Jenis Barang'].str.contains('in', flags=re.IGNORECASE)]

Empty DataFrame
Columns: [Faktur, Tanggal Penjualan, Jenis Kelamin, Jenis Barang, Jumlah, Harga Satuan, urutan, no]
Index: []

In [82]:
#Memilih Data yang Berada di List/Dataframe Lain
#Menampilkan kolom jumlah pada file penjualan yang bernilai 3 dan 2
Jumlah_Faktur = [3, 2]
df[df['Jumlah'].isin(Jumlah_Faktur)]

,Faktur,Tanggal Penjualan,Jenis Kelamin,Jenis Barang,Jumlah,Harga Satuan,urutan,no
0,F001,2023-01-15,Pria,Elektronik,2,500000,penjual no 1,1
3,F004,2023-01-22,Wanita,Kosmetik,3,100000,penjual no 4,4
4,F005,2023-01-25,Pria,Pakaian,2,200000,penjual no 5,5

In [83]:
#P13 memilih berdasarkan satu kondisi

import pandas as pd

data = {
    'Jumlah': [2, 1, 1, 3, 2, 1]
}
df = pd.DataFrame(data)

#P13.1 memilih angka

#1. Sama dengan
hasil = df[df['Jumlah'] == 2]
print(hasil)

#2. Memilih Angka tidak sama dengan
df[df['Jumlah'] != 2]
df[df.Jumlah.ne(2)]
df[~(df['Jumlah'] == 2)]

   Jumlah
0       2
4       2

   Jumlah
1       1
2       1
3       3
5       1

In [84]:
#3. Memilih Angka Lebih Dari
df[df['Jumlah'] > 2]
df[df.Jumlah.gt(2)]

   Jumlah
3       3

In [85]:
#4. Memilih Lebih Dari atau Sama Dengan
df[df['Jumlah'] >= 2]
df[df.Jumlah.ge(2)]

   Jumlah
0       2
3       3
4       2

In [86]:
#5. Memilih Kurang Dari atau Sama Dengan
df[df['Jumlah'] < 2]
df[df.Jumlah.lt(2)]

   Jumlah
1       1
2       1
5       1

In [87]:
# 6. Memilih Kurang Dari atau Sama Dengan
df[df['Jumlah'] <= 2]
df[df.Jumlah.le(2)]

   Jumlah
0       2
1       1
2       1
4       2
5       1

In [88]:
#P.14 membuat kategori tinggi dan rendah
d = {'tinggi': [290, 150], 'rendah': [22, 77]}

df1 = pd.DataFrame(data=d)
df1

   tinggi  rendah
0     290      22
1     150      77

In [89]:
df[df['Jumlah'].isin(df1['tinggi'])]
df1 = pd.DataFrame({'tinggi': [290, 150]})
df2 = pd.DataFrame({'rendah': [22, 77]})

#COBA JUGA INI
df[df['Jumlah'].isin(df2['rendah'])]

Empty DataFrame
Columns: [Jumlah]
Index: []

In [90]:
#Memilih lebih dari satu kondisi
#Memilih diantara dua rentang nilai

df[(df['Jumlah'] > 1) & (df['Jumlah'] < 3)]

   Jumlah
0       2
4       2

In [91]:
import pandas as pd
import re

data = {
    'Faktur': ['F001', 'F002', 'F003', 'F004', 'F005', 'F006'],
    'Tanggal Penjualan': ['2023-01-15', '2023-01-17', '2023-01-20', '2023-01-20', '2023-01-25', '2023-01-28'],
    'Jenis Kelamin': ['Pria', 'Pria', 'Wanita', 'Wanita', 'Pria', 'Wanita'],
    'Jenis Barang': ['Elektronik', 'Pakaian', 'Elektronik', 'Kosmetik', 'Pakaian', 'Elektronik'],
    'Jumlah': [2, 1, 1, 3, 2, 1],
    'Harga Satuan': [500000, 200000, 500000, 100000, 200000, 500000]
}

df = pd.DataFrame(data)

filtered_df = df[df['Jenis Barang'].str.contains('on', flags=re.IGNORECASE) | (df['Jumlah'] > 1)]

print("Hasil filter:")
print(filtered_df)

df.describe()

Hasil filter:
  Faktur Tanggal Penjualan Jenis Kelamin Jenis Barang  Jumlah  Harga Satuan
0   F001        2023-01-15          Pria   Elektronik       2        500000
2   F003        2023-01-20        Wanita   Elektronik       1        500000
3   F004        2023-01-20        Wanita     Kosmetik       3        100000
4   F005        2023-01-25          Pria      Pakaian       2        200000
5   F006        2023-01-28        Wanita   Elektronik       1        500000

         Jumlah   Harga Satuan
count  6.000000       6.000000
mean   1.666667  333333.333333
std    0.816497  186189.867250
min    1.000000  100000.000000
25%    1.000000  200000.000000
50%    1.500000  350000.000000
75%    2.000000  500000.000000
max    3.000000  500000.000000

# <center><div style="font-family: Arial; font-size: 20px; border-radius: 5px; background-color: #40a2adff; padding: 2px; line-height: 2.0; color: #FFFFFF; text-align: line-height;">7. Metode-metode Pandas</div></center>

In [92]:
import pandas as pd

#Metode apply menjalankan fungsi pada setiap elemen dalam Series
data = [10, 29, 50, 55, 60, 69, 73, 81, 91, 99]
d_int = pd.Series(data)

#Fungsi untuk mengelompokkan angka
def kecilbesar(num):
    if num < 99:
        return "kecil"
    elif num >= 10 and num < 99:
        return "sedang"
    else:
        return "besar"

#Terapkan fungsi ke setiap elemen Series
kategori = d_int.apply(kecilbesar)
print(kategori)
df.info()

0    kecil
1    kecil
2    kecil
3    kecil
4    kecil
5    kecil
6    kecil
7    kecil
8    kecil
9    besar
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Faktur             6 non-null      object
 1   Tanggal Penjualan  6 non-null      object
 2   Jenis Kelamin      6 non-null      object
 3   Jenis Barang       6 non-null      object
 4   Jumlah             6 non-null      int64
 5   Harga Satuan       6 non-null      int64
dtypes: int64(2), object(4)
memory usage: 420.0+ bytes